#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
. relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/personal-website-iac/personal-website-iac/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/personal-website-iac/personal-website-iac

To view this run in a browser, visit:
https://app.terraform.io/app/hechaorganization/personal-website-infra/runs/run-2maKj8BFRFnagjiD

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
module.iam.aws_iam_user.github_actions: Refreshing state... [id=github-actions-personal-website-prod]
module.infrastructure.aws_s3_bucket.website: Refreshing state... [id=personal-website-ciarcia]
module.infrastructure.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=personal-website-ciarcia]
module.infrastructure.aws_s3_bucket_acl.bucket_acl: Refreshing state... [id=personal-website-ciarcia,public-read]
module.infrastructure.aws_s3_bucket_website_configuration.bucket_website: Refreshing state... [id=personal-website-ciarcia]
module.infrastructure.module.cdn_website.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E3RFI1R5900MXJ]
module.infrastructure.aws_route53_record.A_record: Refreshing state... [id=Z04217553VJM3IP6I6W8T_ettoreciarcia.com_A]
module.infrastructure.aws_route53_record.AAAA_record: Refreshing state... [id=Z04217553VJM3IP6I6W8T_ettoreciarcia.com_AAAA]
module.iam.aws_iam_policy.github_actions_policy: Refreshing state... [id=arn:aws:iam::860443674636:policy/personal-website-prod-github-actions-policy]
module.iam.aws_iam_user_policy_attachment.github_actions_policy_attachment: Refreshing state... [id=github-actions-personal-website-prod-20230106134754775600000001]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.infrastructure.module.cdn_website.aws_cloudfront_distribution.this[0] has changed
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ etag                           = "E1D2166GEZK1Z4" -> "ECM052B5L2CIR"
        id                             = "E3RFI1R5900MXJ"
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.infrastructure.aws_route53_record.www_AAAA_record will be created
  + resource "aws_route53_record" "www_AAAA_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.ettoreciarcia.com"
      + type            = "AAAA"
      + zone_id         = "Z04217553VJM3IP6I6W8T"

      + alias {
          + evaluate_target_health = false
          + name                   = "d2d1ieikjk86r6.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.infrastructure.aws_route53_record.www_A_record will be created
  + resource "aws_route53_record" "www_A_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.ettoreciarcia.com"
      + type            = "A"
      + zone_id         = "Z04217553VJM3IP6I6W8T"

      + alias {
          + evaluate_target_health = false
          + name                   = "d2d1ieikjk86r6.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @ettoreciarcia, Action: `pull_request`*